app/controllers/admin/roles_controller.rb

INSERT INTO "organizational_roles" ("name", "organizational_unit_type", "created_at", "ancestry", "updated_at", "account_id", "role_type", "position_type", "department_id", "role_description") VALUES('New Role', 'company', '2010-05-02 17:13:29', '54/56/57', '2010-05-02 17:13:29', 1, 'exclusive', 'exclusive', 74, NULL)
---
  def create
    return super unless parent_id = params["role"].delete("parent_id")
    new_child = OrganizationalRole.create!(get_parented_attributes(parent_id,params))